package com.example.whatssaudiarabia

data class AnimalsData(val title: String, val imageRes: Int, val info: String, val id: Int)

val animals = mutableListOf<AnimalsData>(
    AnimalsData(
        "النمر العربي",
        R.drawable.arabic_tiger,
        " هو سلالة مهددة بالانقراض تنتمي إلى شبه الجزيرة العربية، لكن يُعتقد أنه يعيش ضمن مجموعة صغيرة في جبال الحجاز والسروات. وهناك خطط لإعادة توطينها في السعودية. ",
        1
    ),
    AnimalsData(
        "غزال الريم",
        R.drawable.ghazal_alreem,
        "غزال الريم من أشهر الحيوانات التي تتمتع بجمالها البالغ ، فهي تنتشر بصورة كبيرة في شبه الجزيرة العربية و خاصة في المملكة ، تشتهر بجمال عيناها ، و رشاقتها في الحركة ، فهي تعرف لونها الشاحب",
        2
    ),
    AnimalsData(

        " المها العربي",
        R.drawable.arabic_oryx,
        "هو أحد أنواع الظباء أو الغزلان التي تنتمي لفصيلة البقريات، وهو من الحيوانات المهددة بالانقراض، وقد نجحت السعودية في حمايتها وإعادتها إلى البرية",
        3
    ),
    AnimalsData(

        "النعامة العربية",
        R.drawable.arabianostrich,
        " ينتشر هذا الطائر الذي لا يستطيع الطيران بكثرة في جنوب شرق الجزيرة العربية، ولها سرعة فائقة بالجري تصل إلى قرابة الـ 50 كم/ساعة، وتتغذى على النباتات والزواحف.",
        4
    ),
    AnimalsData(

        "الوشق العربي",
        R.drawable.caracal,
        "الوشق العربي ، أو الوشق الصحراوي ، أو الوشق الفارسي ، أحد أنواع القطط المفترسة قصيرة الذيل المهددة بالانقراض ، والمتواجدة بشكل رئيسي في قارة آسيا وأفريقيا ، ويصنف من فئة اللحوم ، وجنسه الكراكال.",
        5
    ),

    AnimalsData(
        "قردة البابون",
        R.drawable.baboons,
        "حيوان اجتماعي يوجد في جنوب غرب السعودية، خاصة في المرتفعات الجبلية مثل أبها والباحة والطائف. وهناك أربعة أنواع من قرود البابون وهم الأصفر، والزيتوني، والرباح المقدسمة، وغينيا. ",
        6
    ),

    AnimalsData(
        "الأسد",
        R.drawable.lion,
        "كانت الأسود تعيش بكثرة في الغابات والمناطق المفتوحة في شبه الجزيرة العربية، فالأسود واللبؤات والأشبال الصغار من الحيوانات الضارية الآكلة للحوم.",
        7
    )
)